Use mermaid graph
